Alansi775/ESCPannelSystem/stm32_firmware/src/board_a/main.cpp
#include <Arduino.h>
#include <string>
#include <vector>
//#include <EEPROM.h> // replaced by direct flash storage
#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"
#include <cstring>
#include "app_config.h"
#include "json_parser.h"
#include "protocol.h"

// ITM trace init (SWO)
extern "C" void trace_init(uint32_t cpu_hz, uint32_t swo_hz);

// AppConfig and enums moved to app_config.h

UART_HandleTypeDef huart2;


// Flash storage configuration
#define FLASH_STORAGE_BASE 0x08060000UL // sector 7 start for STM32F401RE (128KB sector)
#define FLASH_MAGIC 0xDEADBEEFUL
#define FLASH_MAX_BYTES (128 * 1024) // sector size

// Helper to erase sector 7 and write/read
static bool flash_erase_sector7() {
  HAL_FLASH_Unlock();
  FLASH_EraseInitTypeDef EraseInitStruct;
  uint32_t SectorError = 0;
  EraseInitStruct.TypeErase = FLASH_TYPEERASE_SECTORS;
  EraseInitStruct.Sector = FLASH_SECTOR_7;
  EraseInitStruct.NbSectors = 1;
  EraseInitStruct.VoltageRange = FLASH_VOLTAGE_RANGE_3;
  int ret = HAL_FLASHEx_Erase(&EraseInitStruct, &SectorError);
  HAL_FLASH_Lock();
  return (ret == HAL_OK);
}

static bool flash_write_bytes(const uint8_t* data, uint32_t len) {
  if (len == 0 || len > FLASH_MAX_BYTES - 8) return false;
  if (!flash_erase_sector7()) return false;
  HAL_FLASH_Unlock();
  uint32_t addr = FLASH_STORAGE_BASE;
  // write magic
  if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, FLASH_MAGIC) != HAL_OK) { HAL_FLASH_Lock(); return false; }
  addr += 4;
  // write length
  if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, len) != HAL_OK) { HAL_FLASH_Lock(); return false; }
  addr += 4;
  // write payload in 4-byte words
  for (uint32_t i = 0; i < len; i += 4) {
    uint32_t w = 0;
    for (uint32_t b = 0; b < 4; ++b) {
      uint32_t idx = i + b;
      if (idx < len) w |= ((uint32_t)data[idx]) << (8 * b);
    }
    if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, w) != HAL_OK) { HAL_FLASH_Lock(); return false; }
    addr += 4;
  }
  HAL_FLASH_Lock();
  return true;
}

static bool flash_read_bytes(std::vector<uint8_t>& out) {
  uint32_t addr = FLASH_STORAGE_BASE;
  uint32_t magic = *(uint32_t*)addr;
  if (magic != FLASH_MAGIC) return false;
  addr += 4;
  uint32_t len = *(uint32_t*)addr;
  addr += 4;
  if (len == 0 || len > FLASH_MAX_BYTES - 8) return false;
  out.clear();
  out.reserve(len);
  for (uint32_t i = 0; i < len; ++i) {
    uint8_t v = *((uint8_t*)(addr + i));
    out.push_back(v);
  }
  return true;
}

// Initialize USART2 (PA2 TX, PA3 RX) for raw transmit
void initUSART2() {
  // Enable GPIOA and USART2 clocks
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_USART2_CLK_ENABLE();

  GPIO_InitTypeDef GPIO_InitStruct = {0};
  // PA2 = TX, PA3 = RX -> AF7 for USART2
  GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_3;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  HAL_UART_Init(&huart2);
}

// Keep legacy LED pin and add support for common F4 discovery/nucleo LEDs
#define LED_PIN PC13
#define LED_ALT_PORT GPIOD
#define LED_ALT_PIN GPIO_PIN_12

enum RxState { WAIT_H1, WAIT_H2, LEN1, LEN2, CHK, DATA, TERM };

static RxState state = WAIT_H1;
static uint16_t data_len = 0;
static uint16_t data_pos = 0;
static uint8_t recv_checksum = 0;
static std::vector<uint8_t> data_buf;

uint8_t calculate_checksum(const uint8_t* data, uint16_t len) {
  uint8_t c = 0;
  for (uint16_t i = 0; i < len; ++i) c ^= data[i];
  return c;
}

static bool received = false;
static std::vector<uint8_t> stored_data;
static bool has_stored = false;
static uint32_t ignore_serial_until = 0;
// When true, stop printing via USB-Serial; logs will go over ITM/SWO
static bool suppress_serial = false;
static volatile uint32_t led_on_until = 0;
static uint32_t last_heartbeat = 0;
static bool heartbeat_enabled = false; // keep disabled now
static bool in_raw_json = false;
static std::vector<uint8_t> raw_json_buf;

// parsed configuration ready for framing/transports
static AppConfig current_config;
static bool config_ready = false;
// Ensure we only auto-send the binary frame once when a new payload is received
static bool sent_on_receive = false;
// Prevent sending raw binary on the monitored UART by default
// Set to true only when a dedicated downstream ESC (not a monitor) is connected
static bool send_binary_on_uart = false;

// Read a single byte non-blocking from available interfaces.
// Returns -1 if no byte available, otherwise 0..255 value.
static int read_byte_nonblocking() {
  // Prefer hardware USART2 (TTL adapter) if available
  if (huart2.Instance != NULL) {
    if ((__HAL_UART_GET_FLAG(&huart2, UART_FLAG_RXNE)) != RESET) {
      uint8_t ch = (uint8_t)(huart2.Instance->DR & 0xFF);
      return (int)ch;
    }
  }
  // Fallback to USB-CDC Serial
  if (Serial && Serial.available()) {
    int v = Serial.read();
    return v;
  }
  return -1;
}

// Drain any pending input bytes from all sources
static void drain_input() {
  while (read_byte_nonblocking() >= 0) {
    ;
  }
}

// User BOOT button pin (physical BOOT/user button on many dev-boards)
const int USER_BTN_PIN = PA0;
static int last_btn_state = HIGH;

// Debug helper: print current_config over USB Serial
static void debug_print_config() {
  if (!Serial) return;
  Serial.println("---- AppConfig ----");
  Serial.print("version: "); Serial.println((int)current_config.version);
  Serial.print("battery_cells: "); Serial.println((int)current_config.battery_cells);
  Serial.print("battery_voltage: "); Serial.println(current_config.battery_voltage);
  Serial.print("battery_nominal: "); Serial.println(current_config.battery_nominal);
  Serial.print("sensor_type: "); Serial.println((int)current_config.sensor_type);
  Serial.print("sensor_max_rpm: "); Serial.println((unsigned long)current_config.sensor_max_rpm);
  Serial.print("motor_kv: "); Serial.println((int)current_config.motor_kv);
  Serial.print("motor_poles: "); Serial.println((int)current_config.motor_poles);
  Serial.print("control_mode: "); Serial.println((int)current_config.control_mode);
  Serial.print("control_current_limit: "); Serial.println((int)current_config.control_current_limit);
  Serial.print("control_pwm_frequency: "); Serial.println((int)current_config.control_pwm_frequency);
  Serial.print("control_brake_enabled: "); Serial.println((int)current_config.control_brake_enabled);
  Serial.print("safety_max_tempreature: "); Serial.println((int)current_config.safety_max_tempreature);
  Serial.print("safety_overcurrent_limit: "); Serial.println((int)current_config.safety_overcurrent_limit);
  Serial.print("reserved: ");
  for (int i = 0; i < 3; ++i) { Serial.print((int)current_config.reserved[i]); Serial.print(i<2?",":"\n"); }
  Serial.println("-------------------");
}

// send a NUL-terminated string over USART2 if available
static void usart2_print(const char* s) {
  if (huart2.Instance != NULL) {
    HAL_UART_Transmit(&huart2, (uint8_t*)s, (uint16_t)strlen(s), 200);
  }
}

// Print AppConfig over USART2 (same content as debug_print_config)
static void debug_print_config_uart() {
  if (huart2.Instance == NULL) return;
  char buf[128];
  usart2_print("---- AppConfig ----\r\n");
  snprintf(buf, sizeof(buf), "version: %d\r\n", (int)current_config.version); usart2_print(buf);
  snprintf(buf, sizeof(buf), "battery_cells: %d\r\n", (int)current_config.battery_cells); usart2_print(buf);
  snprintf(buf, sizeof(buf), "battery_voltage: %.2f\r\n", current_config.battery_voltage); usart2_print(buf);
  snprintf(buf, sizeof(buf), "battery_nominal: %.2f\r\n", current_config.battery_nominal); usart2_print(buf);
  snprintf(buf, sizeof(buf), "sensor_type: %d\r\n", (int)current_config.sensor_type); usart2_print(buf);
  snprintf(buf, sizeof(buf), "sensor_max_rpm: %lu\r\n", (unsigned long)current_config.sensor_max_rpm); usart2_print(buf);
  snprintf(buf, sizeof(buf), "motor_kv: %d\r\n", (int)current_config.motor_kv); usart2_print(buf);
  snprintf(buf, sizeof(buf), "motor_poles: %d\r\n", (int)current_config.motor_poles); usart2_print(buf);
  snprintf(buf, sizeof(buf), "control_mode: %d\r\n", (int)current_config.control_mode); usart2_print(buf);
  snprintf(buf, sizeof(buf), "control_current_limit: %d\r\n", (int)current_config.control_current_limit); usart2_print(buf);
  snprintf(buf, sizeof(buf), "control_pwm_frequency: %d\r\n", (int)current_config.control_pwm_frequency); usart2_print(buf);
  snprintf(buf, sizeof(buf), "control_brake_enabled: %d\r\n", (int)current_config.control_brake_enabled); usart2_print(buf);
  snprintf(buf, sizeof(buf), "safety_max_tempreature: %d\r\n", (int)current_config.safety_max_tempreature); usart2_print(buf);
  snprintf(buf, sizeof(buf), "safety_overcurrent_limit: %d\r\n", (int)current_config.safety_overcurrent_limit); usart2_print(buf);
  snprintf(buf, sizeof(buf), "reserved: %d,%d,%d\r\n", (int)current_config.reserved[0], (int)current_config.reserved[1], (int)current_config.reserved[2]); usart2_print(buf);
  usart2_print("-------------------\r\n");
}

// print hex over usart2
static void print_hex_uart(const uint8_t* buf, size_t len) {
  if (huart2.Instance == NULL) return;
  char s[8];
  for (size_t i = 0; i < len; ++i) {
    snprintf(s, sizeof(s), "%02X", buf[i]);
    usart2_print(s);
    if (i + 1 < len) usart2_print(" ");
  }
  usart2_print("\r\n");
}

// forward-declare print_hex (defined later) so earlier helpers can call it
static void print_hex(const uint8_t* buf, size_t len);

// Send a frame to Board B (USART2) if available
static void send_frame_to_board_b(const uint8_t* frame, size_t len) {
  if (huart2.Instance == NULL || len == 0) return;
  HAL_UART_Transmit(&huart2, (uint8_t*)frame, (uint16_t)len, 500);

  if (Serial && !suppress_serial) {
    Serial.print("Sent to Board B (HEX): ");
    print_hex(frame, len);
  }
}

// Common handler: store payload bytes to flash, parse to AppConfig, build frame,
// broadcast and print on Serial/USART2. Returns true if successfully stored and parsed.
static bool store_and_apply_payload(const std::vector<uint8_t>& payload) {
  if (payload.empty()) return false;
  if (!flash_write_bytes(payload.data(), (uint32_t)payload.size())) {
    if (Serial && !suppress_serial) Serial.println("Error: failed to write payload to flash");
    if (huart2.Instance != NULL) usart2_print("Error: failed to write payload to flash\r\n");
    return false;
  }
  stored_data = payload;
  has_stored = true;
  config_ready = false;
    if (jsonparser::parse_json_to_appconfig(stored_data, current_config)) {
    config_ready = true;
    if (Serial && !suppress_serial) Serial.println("Stored and parsed config -> ready");
    // print parsed config for verification (USB and USART2 readable copy)
    debug_print_config();
    debug_print_config_uart();
    // If we have not yet auto-sent this payload, construct and send the
    // deterministic binary frame once now (I2C, CAN, UART). Subsequent
    // sends happen only on NRST or explicit user action.
    if (!sent_on_receive) {
      uint8_t frame_buf[64];
      size_t flen = pack_appconfig_frame(current_config, frame_buf, sizeof(frame_buf));
      if (flen > 0) {
        // Print readable HEX first so monitors can see the frame
        if (Serial && !suppress_serial) {
          Serial.print("First-receive Frame hex: ");
          print_hex(frame_buf, flen);
        }
        print_hex_uart(frame_buf, flen);

        send_frame_to_board_b(frame_buf, flen);
        // Transmit binary frame over CAN and I2C for external devices
        send_frame_can(frame_buf, flen);
        send_frame_i2c(frame_buf, flen, 0x42);
        // Transmit raw binary on USART2 (for downstream ESC) after hex
        // Only do this when explicitly enabled to avoid garbled characters
        // on monitors that listen on the same UART.
        if (send_binary_on_uart && huart2.Instance != NULL) {
          HAL_UART_Transmit(&huart2, frame_buf, flen, 500);
        }
        sent_on_receive = true;
      }
    }
    return true;
  } else {
    if (Serial && !suppress_serial) Serial.println("Stored but failed to parse JSON");
    if (huart2.Instance != NULL) usart2_print("Stored but failed to parse JSON\r\n");
    return false;
  }
}

