Alansi775/ESCPannelSystem/stm32_firmware/src/board_a/main.cpp
// Utility: print hex dump of buffer to USB Serial
static void print_hex(const uint8_t* buf, size_t len) {
  if (!Serial) return;
  for (size_t i = 0; i < len; ++i) {
    uint8_t v = buf[i];
    char s[4];
    const char hex[] = "0123456789ABCDEF";
    s[0] = hex[(v >> 4) & 0xF];
    s[1] = hex[v & 0xF];
    s[2] = '\0';
    Serial.print(s);
    if (i + 1 < len) Serial.print(' ');
  }
  Serial.println();
}

void set_led(bool on) {
  // Support boards with PC13 (active LOW) and PD12 (active HIGH)
  // PC13: LED on = LOW; PD12: LED on = HIGH
  // Attempt both so the appropriate LED lights on either board.
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, on ? GPIO_PIN_RESET : GPIO_PIN_SET);
  HAL_GPIO_WritePin(LED_ALT_PORT, LED_ALT_PIN, on ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

void process_valid_packet() {
  // Turn LED ON briefly to indicate receipt
  set_led(true);
  led_on_until = HAL_GetTick() + 200; // 200 ms indicator
  // (do not block here; LED will be reset in main loop)
  // store the received payload for later inspection and persist to flash
  // avoid storing duplicate payloads
  if (has_stored && stored_data.size() == data_buf.size()) {
    bool same = true;
    for (size_t i = 0; i < stored_data.size(); ++i) {
      if (stored_data[i] != data_buf[i]) { same = false; break; }
    }
    if (same) {
      // duplicate packet received; ignore re-store but set short ignore window
      ignore_serial_until = HAL_GetTick() + 1000;
      drain_input();
      if (Serial && !suppress_serial) Serial.println("Duplicate packet received - ignored");
      // reset parser to avoid partial re-entry
      state = WAIT_H1;
      data_buf.clear();
      data_pos = 0;
      return;
    }
  }
  // Always accept valid framed packets and process their payload
  if (!data_buf.empty()) {
    store_and_apply_payload(data_buf);
    // guard against immediate re-processing of forwarded bytes
    ignore_serial_until = HAL_GetTick() + 1000;
    drain_input();
  }
}

void setup() {
  pinMode(LED_PIN, OUTPUT);
  // ensure clocks and pins for common LED locations are configured
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  digitalWrite(LED_PIN, HIGH); // LED off (active LOW)

  // configure user button
  pinMode(USER_BTN_PIN, INPUT_PULLUP);
  last_btn_state = digitalRead(USER_BTN_PIN);

  Serial.begin(115200);
  // Initialize HAL (safe to re-init) and USART2 for PA2/PA3
  HAL_Init();
  // Initialize SWO/ITM tracing (2 MHz). Keep USB serial enabled so we can
  // read incoming data over the TTL adapter / USB-Serial device.
  trace_init(SystemCoreClock, 2000000);
  suppress_serial = false;

  // If the reset was caused by an external pin reset (NRST), clear stored data
  // Capture reset flags so we can react after loading stored data.
  uint32_t reset_flags = RCC->CSR;
  initUSART2();

  // (removed startup banner to avoid spurious characters on TTL monitor)

  // EEPROM not used on this core; using direct flash-backed storage instead

  // Do NOT clear stored data on NRST: stored data must persist across resets.
  // clear reset flags
  RCC->CSR |= RCC_CSR_RMVF;

  // Load stored data from flash if present
  if (flash_read_bytes(stored_data)) {
    has_stored = true;
    if (Serial && !suppress_serial) Serial.println("Loaded stored payload from flash");
    // parse existing stored JSON into AppConfig so EEPROM/flash data is applied on boot
    config_ready = false;
    if (jsonparser::parse_json_to_appconfig(stored_data, current_config)) {
      config_ready = true;
      if (Serial && !suppress_serial) {
        Serial.println("Parsed stored config on startup");
        debug_print_config();
      }
      // Do not auto-broadcast the binary frame on generic startup here.
      // Broadcasting is performed explicitly on NRST or on first receipt
      // of a new payload (see store_and_apply_payload).
    } else {
      if (Serial && !suppress_serial) Serial.println("Failed to parse stored JSON on startup");
    }
  } else {
    has_stored = false;
  }

  // If the reset was caused by an external pin reset (NRST/PINRSTF),
  // broadcast the stored JSON/config/frame instead of erasing it.
  if (reset_flags & RCC_CSR_PINRSTF) {
    if (has_stored) {
      if (Serial && !suppress_serial) Serial.println("NRST detected: broadcasting stored payload");
      if (Serial) {
        Serial.write(stored_data.data(), stored_data.size());
        Serial.write("\r\n");
      }
      if (huart2.Instance != NULL) {
        HAL_UART_Transmit(&huart2, (uint8_t*)stored_data.data(), stored_data.size(), 3000);
        HAL_UART_Transmit(&huart2, (uint8_t*)"\r\n", 2, 50);
      }
      // ensure parsed and printed
      if (!config_ready) {
        if (jsonparser::parse_json_to_appconfig(stored_data, current_config)) config_ready = true;
      }
      if (config_ready) {
        debug_print_config();
        debug_print_config_uart();
        // build and broadcast deterministic frame
        uint8_t frame_buf[64];
        size_t flen = pack_appconfig_frame(current_config, frame_buf, sizeof(frame_buf));
        if (flen > 0) {
          // Print readable HEX on monitors
          if (Serial && !suppress_serial) {
            Serial.print("NRST Broadcast Frame hex: "); print_hex(frame_buf, flen);
          }
          print_hex_uart(frame_buf, flen);

          send_frame_to_board_b(frame_buf, flen);
          // Transmit binary frame over USART2 (for downstream ESC)
          // Guarded to avoid garbled output on monitors sharing the same UART.
          if (send_binary_on_uart && huart2.Instance != NULL) {
            HAL_UART_Transmit(&huart2, frame_buf, flen, 500);
          }
          // Also send binary over CAN and I2C
          send_frame_can(frame_buf, flen);
          send_frame_i2c(frame_buf, flen, 0x42);
        }
      }
    } else {
      if (Serial && !suppress_serial) Serial.println("NRST detected: no stored payload");
      if (huart2.Instance != NULL) usart2_print("NRST detected: no stored payload\r\n");
    }
  }
}

void loop() {
  // handle LED timeout (turn off after short indicator)
  if (led_on_until != 0 && HAL_GetTick() >= led_on_until) {
    set_led(false);
    led_on_until = 0;
  }

  // heartbeat disabled (removed to avoid noisy output)
  // Read bytes from USART2 or Serial (non-blocking) and feed to parser
  while (true) {
    // If we're in an ignore window, drain all incoming bytes and skip parsing
    if (ignore_serial_until != 0 && HAL_GetTick() < ignore_serial_until) {
      drain_input();
      break;
    }
    int v = read_byte_nonblocking();
    if (v < 0) break;
    uint8_t b = (uint8_t)v;

