Alansi775/ESCPannelSystem/stm32_firmware/src/board_a/main.cpp
    // (no diagnostic echo) -- do not mirror raw bytes to avoid mixing binary

    // Raw JSON mode: detect start of JSON object/array and collect until newline
    if (!in_raw_json && (b == '{' || b == '[')) {
      in_raw_json = true;
      raw_json_buf.clear();
      raw_json_buf.push_back(b);
      continue; // read next byte
    }
    if (in_raw_json) {
      raw_json_buf.push_back(b);
      if (b == '\n') {
        // process raw JSON line (trim trailing CR/LF)
        while (!raw_json_buf.empty() && (raw_json_buf.back() == '\n' || raw_json_buf.back() == '\r')) raw_json_buf.pop_back();
        if (!raw_json_buf.empty()) {
          store_and_apply_payload(raw_json_buf);
        }
        in_raw_json = false;
        raw_json_buf.clear();
      }
      continue; // handled as raw JSON
    }

    switch (state) {
      case WAIT_H1:
        if (b == 0xAE) state = WAIT_H2;
        break;

      case WAIT_H2:
        if (b == 0x53) state = LEN1;
        else state = (b == 0xAE) ? WAIT_H2 : WAIT_H1;
        break;

      case LEN1:
        data_len = ((uint16_t)b) << 8;
        state = LEN2;
        break;

      case LEN2:
        data_len |= b;
        if (data_len == 0 || data_len > 8192) {
          // invalid length — reset silently
          state = WAIT_H1;
        } else {
          data_buf.clear();
          data_buf.reserve(data_len);
          data_pos = 0;
          state = CHK;
        }
        break;

      case CHK:
        recv_checksum = b;
        state = DATA;
        break;

      case DATA:
        data_buf.push_back(b);
        data_pos++;
        if (data_pos >= data_len) state = TERM;
        break;

      case TERM:
        if (b == 0x0A) {
          uint8_t c = calculate_checksum(data_buf.data(), data_len);
          if (c == recv_checksum) {
              process_valid_packet();
            } else {
            // checksum mismatch — ignore
          }
        } else {
          // missing terminator — ignore
        }
        // always reset parser
        state = WAIT_H1;
        break;
    }
  }

  // poll BOOT/user button for a press event (falling edge)
  int btn = digitalRead(USER_BTN_PIN);
  if (btn == LOW && last_btn_state == HIGH) {
    // button pressed (debounced)
    uint32_t start = HAL_GetTick();
    // simple debounce
    delay(50);
    if (digitalRead(USER_BTN_PIN) != LOW) {
      // bounce — ignore
    } else {
      // wait until release to measure duration
      while (digitalRead(USER_BTN_PIN) == LOW) {
        delay(10);
      }
      uint32_t duration = HAL_GetTick() - start;

      if (has_stored) {
        // suppress other serial prints while we output the JSON
        suppress_serial = true;
        // set ignore window BEFORE drain/transmit
        ignore_serial_until = HAL_GetTick() + 5000;
        drain_input();

        if (duration < 1000) {
          // short press: print JSON atomically to USB only (no USART2)
          if (!stored_data.empty()) {
            if (Serial) {
              Serial.write(stored_data.data(), stored_data.size());
              Serial.write("\r\n");
            }
            if (huart2.Instance != NULL) {
              HAL_UART_Transmit(&huart2, (uint8_t*)stored_data.data(), stored_data.size(), 3000);
              HAL_UART_Transmit(&huart2, (uint8_t*)"\r\n", 2, 50);
            }
            // Also attempt to parse and print parsed AppConfig for verification
            if (!config_ready) {
              if (jsonparser::parse_json_to_appconfig(stored_data, current_config)) {
                config_ready = true;
              }
            }
            if (config_ready) {
              debug_print_config();
              debug_print_config_uart();
              // V2 frame hex
              build_and_print_frame_v2(current_config);
              // also print ASCII frame hex on huart2
              uint8_t frame_buf2[64];
              size_t flen2 = pack_appconfig_frame(current_config, frame_buf2, sizeof(frame_buf2));
              if (flen2 > 0) print_hex_uart(frame_buf2, flen2);
            }
          }
        } else {
          // long press: send JSON only over USART2 (no USB print)
          if (!stored_data.empty()) {
            HAL_UART_Transmit(&huart2, (uint8_t*)stored_data.data(), stored_data.size(), 3000);
            // Also pack deterministic frame and send after raw JSON
            if (!config_ready) {
              if (jsonparser::parse_json_to_appconfig(stored_data, current_config)) {
                config_ready = true;
              }
            }
            if (config_ready) {
              uint8_t frame_buf[64];
              size_t flen = pack_appconfig_frame(current_config, frame_buf, sizeof(frame_buf));
              if (flen > 0) {
                // Do not send raw binary on USART2; print hex instead.
                if (Serial && !suppress_serial) {
                  Serial.print("Frame hex: ");
                  print_hex(frame_buf, flen);
                }
                print_hex_uart(frame_buf, flen);
                bool can_ok = send_frame_can(frame_buf, flen);
                bool i2c_ok = send_frame_i2c(frame_buf, flen, 0x42);
                if (Serial && !suppress_serial) {
                  Serial.print("CAN send: "); Serial.println(can_ok?"ok":"no");
                  Serial.print("I2C send: "); Serial.println(i2c_ok?"ok":"no");
                }
                // also print V2 frame for ESC
                build_and_print_frame_v2(current_config);
              }
            }
          }
        }

        // drain any bytes arrived during transmit
        drain_input();
        suppress_serial = false;
        // reset parser
        state = WAIT_H1;
        data_buf.clear();
        data_pos = 0;
      } else {
        if (Serial && !suppress_serial) Serial.println("<no stored data>");
      }
    }
  }
  last_btn_state = btn;
}